{
  "HOME": "Home",
  "ABOUT_TEXT": "About me",
  "EXPERIENCE_TEXT": "Experience",
  "SKILLS_TEXT": "Skills",
  "PROJECTS_TEXT": "Projects",
  "PERSONAL_TEXT": "Personal interests",
  "ABOUT": {
    "TITLE": "About Me",
    "SUBTITLE": "Junior Developer in apprenticeship",
    "DESCRIPTION": "Currently in 2nd year of engineering school at ISIMA in Clermont-Ferrand, I am on a work-study program at CGI for the client Michelin.",
    "BIRTHDATE": "Date of Birth",
    "CITY": "City",
    "WORK": "Work Experience",
    "TIME_IN_COMPANY": "2 years and 3 months",
    "DEGREE": "Last degree obtained",
    "EMAIL": "Email",
    "REPO": "Repository",
    "MORE": "As a network and development enthusiast, I am curious to discover new ways of programming as well as new technologies. I have carried out several projects in Flutter, and numerous APIs in PHP Slim as well as in Java SpringBoot. I am developing a microservice in Spring Boot and a full stack Angular/NodeJs application as part of my work-study program, which allows me to develop my skills in Java, NodeJs and Angular.",
    "COUNTER": {
      "PROJECT_HOURS": "School Project hours completed :",
      "HOURS": "hours",
      "LANGUAGES": "More than",
      "LANGUAGES_KNOW": "languages known and mastered",
      "PROJECTS": "J'ai couché avec  ",
      "PROJECTS_MADE": "hommes",
      "LINUX": "Using Linux for",
      "YEARS": "years"
    }
  },
  "SKILLS": {
    "TITLE": "Skills",
    "DESCRIPTION": "Here are my different skills along with their proficiency level:"
  },
  "PERSO": {
    "TITLE": "Personal interests",
    "PIANO": {
      "TITLE": "Piano",
      "DESC": "My grandmother taught me piano when I was in primary school, and I resumed as a self-taught musician 5 years ago"
    },
    "CHANT": {
      "TITLE": "Singing",
      "DESC": "I recently started learning singing with a teacher so I can accompany my mother who plays guitar"
    },
    "BOXE": {
      "TITLE": "Boxing",
      "DESC": "A coach at my gym introduced me to Thai and English boxing with a punching bag, and I continued by joining an English boxing club since early 2025"
    },
    "MUSCU": {
      "TITLE": "Weight training",
      "DESC": "I was enrolled at the gym for 3 years, and now I continue by practicing Street Workout."
    },
    "COURSE": {
      "TITLE": "Running",
      "DESC": "I started training in early 2024, and I completed the 'Course des Volcans' (25km, 550d+) and the 'Course des 9 Clochers' (28km, 550d+) at the end of 2024"
    },
    "CINEMA": {
      "TITLE": "Cinema",
      "DESC": "A cinephile thanks to my sister and parents, I continue going to the cinema regularly and enjoy sharing my favorite movies and series with my friends and family"
    }
  },
  "PROJECTS": {
    "TITLE": "My Projects",
    "TECHNOLOGIES": "Technologies used",
    "YEAR": "Year",
    "NOTE": "Final grade",
    "REPO": "Repository link",

    "DAFL": {
      "TITLE": "DAFL Music",
      "DESCRIPTION": "DAFL Music is a project I did with 3 classmates as part of our 2nd year IT program.\n\nThe project concept is inspired by Tinder and Spotify. For example, you install the DAFL Music mobile app and meet someone else with the app. The app then shows the music that person was listening to on your phone, allowing you to discover new music and artists.\n\nOnce you liked the other person’s track, if they liked yours too at the same meeting moment, you can chat together and share music discoveries.\n\nThis project was a real technical challenge, as we used a technology we didn’t know, Flutter, and had to implement several servers such as the messaging server. We did a good job but didn’t have time to finish it completely.\n\nBelow are some images of our project, and the repository link:",
      "TECHNOLOGIES": "Flutter, PHP Slim, SQL",
      "YEAR": "2022-2023",
      "NOTE": "13.5/20"
    },

    "FANTOM": {
      "TITLE": "Fantom Games",
      "DESCRIPTION": "Fantom Games was realized as part of my 3rd year IT program. In a team of 4, we built a website with mini-games allowing users to earn crypto-assets while having fun.\n\nWant to play mini-games with your friends and earn money at the same time? Fantom Games is the site for that! The project context was simple, each mini-game victory gives Fantom Coin, a crypto-asset developed specifically for the project.\n\nThe site features tic-tac-toe and battleship. Here’s the server link (still in development, may have bugs): https://www.fantomgames.eu\n\nThis project was very complex technically. Deploying a crypto-asset was expensive, but we still managed most of the tasks. The site works despite budget limits.\n\nBelow are some images of our project, and the repository link:",
      "TECHNOLOGIES": "Flutter, Dart, Socket IO (Javascript), PHP Slim, Docker, Reverse Proxy, Cryptocurrency",
      "YEAR": "2023-2024",
      "NOTE": "15.5/20"
    },

    "TEMOIGNAGES": {
      "TITLE": "Testimonials",
      "DESCRIPTION": "Last 2nd year project, Testimonials aims to collect student and teacher feedback and display them online.\n\nThe topic was provided by our department and highlights real experiences of people who attended the program, to guide potential students.\n\nFor example, we interviewed several students and teachers, filming short 5-minute videos to ask questions and gather insights.\n\nThe project was simple on paper, but we faced difficulties like website deployment and workload issues within the team, preventing a perfect and fully functional site.\n\nBelow are some images of our project, and the repository link:",
      "TECHNOLOGIES": "HTML, CSS, PHP, PHP Slim, SQL",
      "YEAR": "2023",
      "NOTE": "12/20"
    },
    "IFTLZ": {
      "TITLE": "IFTLZ",
      "DESCRIPTION": "IFTLZ is a project that aims to recognize sounds using signal processing (Fourier transform) during the first year of engineering school at ISIMA. The subject was given by our professors at the beginning of the year and allowed us to integrate solid mathematical concepts into a computer science project.\n\nThe project was divided into two parts: the first one for designing the project, and the second one for developing the solution. Our project went well, the work distribution was efficient, and we managed to deliver a functional application that used the Spotify API to retrieve information about the music our application analyzed. This project allowed us to successfully validate the year and also gain many skills in modeling and project organization.",
      "TECHNOLOGIES": "Flutter, Dart, PHP Slim, Reverse Proxy, Python, Spotify API",
      "YEAR": "2024-2025",
      "NOTE": "Validated UE"
    }

  },
  "EXPERIENCES": {
    "TITLE": "Experiences",
    "EXP1": {
      "DATE": "July 2022",
      "COMPANY": "Customer advisor at Sarl Top Modèle, Lozanne, 69380",
      "DESCRIPTION": "My first summer job, I was able to discover the business world and improve my communication and sales skills while working in a small team.",
      "TASKS": {
        "1": "Sales, cashier duties",
        "2": "Teamwork",
        "3": "Stock reception and sorting"
      }
    },
    "EXP2": {
      "DATE": "April 10 - June 16, 2023",
      "COMPANY": "Internship at CGI for Michelin",
      "DESCRIPTION": "My first internship during my BUT program, where I gained experience in database scripting, monitoring, and teamwork in an industrial context.",
      "TASKS": {
        "1": "Developed a flow management and monitoring application",
        "2": "Wrote numerous SQL scripts with Oracle",
        "3": "Used Splunk for monitoring"
      }
    },
    "EXP3": {
      "DATE": "September 2023 - August 2024",
      "COMPANY": "Apprenticeship at CGI for Michelin",
      "DESCRIPTION": "After my internship, CGI offered me an apprenticeship. This allowed me to work on real client projects, strengthen my technical skills, and be fully integrated in the MB4 team of the CORTEX program.",
      "TASKS": {
        "1": "Developed services for Kafka testing",
        "2": "Created Grafana dashboards",
        "3": "Developed microservices with Spring Boot",
        "4": "Configured Kafka and AKHQ with Docker"
      }
    },
    "EXP4": {
      "DATE": "September 2024 - August 2025",
      "COMPANY": "Apprenticeship at CGI for Michelin",
      "DESCRIPTION": "After my first apprenticeship year at CGI, I continued in the same position to accompany my first year at ISIMA engineering school.",
      "TASKS": {
        "1": "Developed services for Kafka testing",
        "2": "Developed a service to optimize Industrialization and Production deployments",
        "3": "Created a service using Angular and NodeJS",
        "4": "Configured GitLab CI/CD pipelines for my team"
      }
    }
  }
}
