{
  "HOME": "Accueil",
  "ABOUT_TEXT": "À propos de moi",
  "EXPERIENCE_TEXT": "Expériences",
  "SKILLS_TEXT": "Compétences",
  "PROJECTS_TEXT": "Projets",
  "PERSONAL_TEXT": "Intérêt personnel",
  "ABOUT": {
    "TITLE": "À propos de moi",
    "SUBTITLE": "Développeur Junior en alternance",
    "DESCRIPTION": "Actuellement en 2ème école d'ingénieur à ISIMA à Clermont-Ferrand, je suis en alternance chez CGI pour le client Michelin.",
    "BIRTHDATE": "Date de naissance",
    "CITY": "Ville",
    "WORK": "Expérience d'entreprise",
    "TIME_IN_COMPANY": "2 ans et 3 mois",
    "DEGREE": "Dernier diplôme obtenu",
    "EMAIL": "Mail",
    "REPO": "Repo",
    "MORE": "Adepte de réseau et de développement, je suis curieux de découvrir de nouvelles façon de programmer ainsi que de nouvelles technologies. J'ai réalisé plusieurs projets en Flutter, et de nombreuses API en PHP Slim ainsi qu'en Java SpringBoot. Je réalise un microservice en Spring Boot et une application full stack Angular/NodeJs dans le cadre de mon alternance, ce qui me permet de développer mes capacités en Java, en NodeJs ainsi qu'en Angular.",
    "COUNTER": {
      "PROJECT_HOURS": "Heures de projets écoles réalisées :",
      "HOURS": "heures",
      "LANGUAGES": "Plus de",
      "LANGUAGES_KNOW": "langages connus et maitrisés",
      "PROJECTS": "Année d'études : ",
      "PROJECTS_MADE": "ans",
      "LINUX": "Utilisation de Linux depuis",
      "YEARS": "années"
    }
  },
  "SKILLS": {
    "TITLE": "Compétences",
    "DESCRIPTION": "Voici mes différentes compétences ainsi que leur niveau de maîtrise :"
  },
  "PERSO": {
    "TITLE": "Intérêt personnel",
    "PIANO": {
      "TITLE": "Piano",
      "DESC": "Ma grand-mère m'as appris le piano quand j'était en primaire, et j'ai repris en autodidacte depuis 5 ans."
    },
    "CHANT": {
      "TITLE": "Chant",
      "DESC": "J'ai récemment commencé à apprendre le chant avec un prof pour pouvoir accompagner ma mère qui joue de la guitare."
    },
    "BOXE": {
      "TITLE": "Boxe",
      "DESC": "Un coach à ma salle de sport m'as initié à la boxe thaï et anglaise avec un sac de frappe, et j'ai donc continué en m'inscrivant à un club de boxe anglaise depuis début 2025."
    },
    "MUSCU": {
      "TITLE": "Musculation",
      "DESC": "J'était inscrit à la salle de sport pendant 3 ans, et maintenant je continue en faisant du Street Workout."
    },
    "COURSE": {
      "TITLE": "Course à pied",
      "DESC": "J'ai commencé à m'entraîner début 2024, et j'ai réalisé la Course des Volcans (25km, 550d+) et la Course des 9 Clochers (28km, 550D+) à la fin de l'année 2024."
    },
    "CINEMA": {
      "TITLE": "Cinéma",
      "DESC": "Cinéphile grâce à ma soeur et mes parents, je continue d'aller régulierement au cinéma et de faire découvrir mes films et séries preferées à mon entourage."
    }
  },
  "PROJECTS": {
    "TITLE": "Mes projets",
    "TECHNOLOGIES": "Technologies utilisées",
    "YEAR": "Année de réalisation",
    "NOTE": "Note finale",
    "REPO": "Lien du répo",

    "DAFL": {
      "TITLE": "DAFL Music",
      "DESCRIPTION": "DAFL Music est un projet que j'ai réalisé à l'aide de 3 de mes camarades dans le cadre de notre BUT Informatique de deuxième année.\n\nLe concept du projet s'inspire de Tinder et de Spotify. Par exemple, vous avez installé l'application mobile DAFL Music et vous croisez quelqu'un qui a aussi l'application, par conséquent cela va afficher la musique qu'écoutait l'utilisateur que vous avez croisé sur votre téléphone. Cela permet de découvrir de nouvelles musiques et de nouveaux artistes.\n\nUne fois que vous avez aimé le son de la personne que vous avez croisé, si cette personne a aussi aimé le son que vous avez écouté quand vous vous êtes croisés vous allez pouvoir discuter ensemble, afin de faire de nouvelles découvertes de sons et d'artistes.\n\nCe projet était un vrai challenge technique, car nous avons utilisé une technologie que nous ne connaissions pas, Flutter, et nous devions réaliser différents serveurs comme le serveur de messagerie. Nous avons plutôt bien réussi le projet, mais nous n'avons pas eu le temps de le finir malheureusement.\n\nVoici ci-dessous quelques images de notre projet, ainsi que le lien du répo :",
      "TECHNOLOGIES": "Flutter, PHP Slim, SQL",
      "YEAR": "2022-2023",
      "NOTE": "13.5/20"
    },

    "FANTOM": {
      "TITLE": "Fantom Games",
      "DESCRIPTION": "Fantom Games a été réalisé dans le cadre de ma troisième année de BUT Informatique. Nous avons réalisé en équipe de 4 un site web avec des mini-jeux permettant de gagner des crypto-actifs tout en s'amusant.\n\nVous souhaitez faire des petits mini-jeux avec vos amis et gagner de l'argent en même temps? Fantom Games est le site qu'il vous faut! Le contexte de ce projet était de faire un site web assez simple, avec des mini-jeux et chaque victoire à un mini-jeu permettait de gagner des Fantom Coin, un crypto-actif développé spécialement pour le projet.\n\nLe site propose un morpion et une bataille navale fonctionnelle. Voici le lien du serveur (encore en développement, des bugs peuvent arriver) : https://www.fantomgames.eu\n\nCe projet a été très compliqué, de par son aspect technique car réaliser un crypto-actif était très complexe. Nous avons quand même bien réussi ces différentes tâches, mais déployer un crypto-actif revenait à trop cher, nous n'avons donc pas d'argent derrière le site mais il marche tout de même.\n\nVoici ci-dessous quelques images de notre projet, ainsi que le lien du répo :",
      "TECHNOLOGIES": "Flutter, Dart, Socket IO (Javascript), PHP Slim, Docker, Reverse Proxy, Cryptomonnaie",
      "YEAR": "2023-2024",
      "NOTE": "15.5/20"
    },

    "TEMOIGNAGES": {
      "TITLE": "Témoignages",
      "DESCRIPTION": "Dernier projet de 2ème année, Témoignage est un projet qui a pour but de récupérer des témoignages d'étudiants et de profs et de les afficher en ligne.\n\nLe sujet était donné par notre département, et il permettait de mettre en avant les vrais témoignages des gens qui ont suivi la formation, afin de guider au mieux les personnes souhaitant rejoindre cette formation.\n\nPar exemple, on interrogeait différents élèves et profs, et on filmait ensuite avec eux une petite vidéo de 5 minutes ou on pose quelques questions pour en savoir plus.\n\nCe projet était assez simple sur papier, mais nous avons eu pas mal de difficulté comme par exemple le déploiement du site. Nous avons aussi eu des problèmes de charge de travail au sein du groupe, ce qui a empêché de rendre un site parfait et fonctionnel.\n\nVoici ci-dessous quelques images de notre projet, ainsi que le lien du répo :",
      "TECHNOLOGIES": "HTML, CSS, PHP, PHP Slim, SQL",
      "YEAR": "2023",
      "NOTE": "12/20"
    },
    "IFTLZ": {
      "TITLE": "IFTLZ",
      "DESCRIPTION": "IFTLZ est un projet qui vise à reconnaître des sons en utilisant un traitement du signal (transformée de Fourier) pendant la première année d'école d'ingénieur à Isima. Le sujet était donné par nos profs au début de l'année, et nous a permis d'intégrer de bonnes notions de mathématiques dans un projet informatique.\n\nLe projet était divisé en deux parties, la première pour  le projet et une deuxième pour développer la solution. Notre projet s'est bien déroulé, la répartition du travail a été bien faite et nous avons pu rendre une application fonctionnelle, qui utilisait l'API de Spotify afin de pouvoir récupérer les informations sur les musiques que notre application . Le projet nous  permis de largement valider l'année, et aussi de gagner de nombreuses compétences en modélisation et en organisation de projet.",
      "TECHNOLOGIES": "Flutter, Dart, PHP Slim, Reverse Proxy, Python, API Spotify",
      "YEAR": "2024-2025",
      "NOTE": "UE Validée"
    }
  },
  "EXPERIENCES": {
    "TITLE": "Expériences",
    "EXP1": {
      "DATE": "Juillet 2022",
      "COMPANY": "Conseiller clientèle chez Sarl Top Modèle, Lozanne, 69380",
      "DESCRIPTION": "Mon premier travail d'été, j'ai pu découvrir le monde de l'entreprise...",
      "TASKS": {
        "1": "Vente, caisse",
        "2": "Travail dans une équipe",
        "3": "Réception et tri de la réserve"
      }
    },
    "EXP2": {
      "DATE": "10 Avril - 16 Juin 2023",
      "COMPANY": "Stage chez CGI pour Michelin",
      "DESCRIPTION": "Premier stage dans le cadre de mon BUT...",
      "TASKS": {
        "1": "Développement d'une application de gestion de flux monitoring",
        "2": "Écriture de nombreux scripts SQL avec Oracle",
        "3": "Utilisation de Splunk"
      }
    },
    "EXP3": {
      "DATE": "Septembre 2023 - Août 2024",
      "COMPANY": "Alternance chez CGI pour Michelin",
      "DESCRIPTION": "Après mon stage, CGI m'a proposé une alternance...",
      "TASKS": {
        "1": "Développement de services pour tests Kafka",
        "2": "Création de Dashboard Grafana",
        "3": "Création de micro-services SpringBoot",
        "4": "Configuration Kafka et AKHQ avec Docker"
      }
    },
    "EXP4": {
      "DATE": "Septembre 2024 - Août 2025",
      "COMPANY": "Alternance chez CGI pour Michelin",
      "DESCRIPTION": "Après ma première année d'alternance à CGI, j'ai continué dans le même cadre pour accompagner ma première année d'école d'ingénieur à ISIMA",
      "TASKS": {
        "1": "Développement de services pour tests Kafka",
        "2": "Développement d'un service pour optimiser les Mise en Indus et Mise en Productions",
        "3": "Création d'un service en Angular et NodeJS'",
        "4": "Configuration de CI/CD Gitlab pour mon équipe"
      }
    }
  }
}
