{
  "HOME": "Accueil",
  "ABOUT_TEXT": "À propos de moi",
  "EXPERIENCE_TEXT": "Expériences",
  "SKILLS_TEXT": "Compétences",
  "PROJECTS_TEXT": "Projets",
  "PERSONAL_TEXT": "Intérêt personnel",
  "ABOUT": {
    "TITLE": "À propos de moi",
    "SUBTITLE": "Développeur Junior en alternance",
    "DESCRIPTION": "Actuellement en 2ème école d'ingénieur à ISIMA à Clermont-Ferrand, je suis en alternance chez CGI pour le client Michelin.",
    "BIRTHDATE": "Date de naissance",
    "CITY": "Ville",
    "WORK": "Expérience d'entreprise",
    "TIME_IN_COMPANY": "2 ans et 3 mois",
    "DEGREE": "Dernier diplôme obtenu",
    "EMAIL": "Mail",
    "REPO": "Repo",
    "MORE": "Adepte de réseau et de développement, je suis curieux de découvrir de nouvelles façon de programmer ainsi que de nouvelles technologies. J'ai réalisé plusieurs projets en Flutter, et de nombreuses API en PHP Slim ainsi qu'en Java SpringBoot. Je réalise un microservice en Spring Boot et une application full stack Angular/NodeJs dans le cadre de mon alternance, ce qui me permet de développer mes capacités en Java, en NodeJs ainsi qu'en Angular.",
    "COUNTER": {
      "PROJECT_HOURS": "Heures de projets écoles réalisées :",
      "HOURS": "heures",
      "LANGUAGES": "Plus de",
      "LANGUAGES_KNOW": "langages connus et maitrisés",
      "PROJECTS": "J'ai couché avec  ",
      "PROJECTS_MADE": "hommes",
      "LINUX": "Utilisation de Linux depuis",
      "YEARS": "années"
    }
  },
  "SKILLS": {
    "TITLE": "Compétences",
    "DESCRIPTION": "Voici mes différentes compétences ainsi que leur niveau de maîtrise :"
  },
  "PERSO": {
    "TITLE": "Intérêt personnel",
    "PIANO": {
      "TITLE": "Piano",
      "DESC": "Ma grand-mère m'as appris le piano quand j'était en primaire, et j'ai repris en autodidacte depuis 5 ans."
    },
    "CHANT": {
      "TITLE": "Chant",
      "DESC": "J'ai récemment commencé à apprendre le chant avec un prof pour pouvoir accompagner ma mère qui joue de la guitare."
    },
    "BOXE": {
      "TITLE": "Boxe",
      "DESC": "Un coach à ma salle de sport m'as initié à la boxe thaï et anglaise avec un sac de frappe, et j'ai donc continué en m'inscrivant à un club de boxe anglaise depuis début 2025."
    },
    "MUSCU": {
      "TITLE": "Musculation",
      "DESC": "J'était inscrit à la salle de sport pendant 3 ans, et maintenant je continue en faisant du Street Workout."
    },
    "COURSE": {
      "TITLE": "Course à pied",
      "DESC": "J'ai commencé à m'entraîner début 2024, et j'ai réalisé la Course des Volcans (25km, 550d+) et la Course des 9 Clochers (28km, 550D+) à la fin de l'année 2024."
    },
    "CINEMA": {
      "TITLE": "Cinéma",
      "DESC": "Cinéphile grâce à ma soeur et mes parents, je continue d'aller régulierement au cinéma et de faire découvrir mes films et séries preferées à mon entourage."
    }
  }


}
